Revit 2027 API
Camera.VerticalExtent Property
 Vertical extent of the camera's view, measured at target distance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VerticalExtent { get; set; }
Public Property VerticalExtent As Double
	Get
	Set
public:
property double VerticalExtent {
	double get ();
	void set (double value);
}
member VerticalExtent : float with get, set
Property Value
Double
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace